content/note/20241017134446-ansible.md
---
title: "Ansible"
author: ["Shahin Azad"]
draft: false
---

Here I share, tips and tricks I learn while working with [Ansible](https://www.ansible.com/).


## Run a specific task or group of task {#run-a-specific-task-or-group-of-task}

-   First tag the resource
    ```yaml
    tasks:

        - yum: name={{ item }} state=installed
          with_items:
    ​         - httpd
    ​         - memcached
          tags:
    ​         - packages

        - template: src=templates/src.j2 dest=/etc/foo.conf
          tags:
    ​         - configuration
    ```

-   Then run it using:
    ```bash
    ansible-playbook example.yml --tags "configuration,packages"
    ```

-   Or skip those tags using `--skip-tags`.
